brew "atuin"
brew "bash-preexec"
brew "bat"
brew "direnv"
brew "duf"
brew "dysk"
brew "eza"
brew "fd"
brew "gh"
brew "glab"
brew "neovim"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "tealdeer"
brew "television"
brew "trash-cli"
brew "ugrep"
brew "uutils-coreutils"
brew "yq"
brew "zoxide"
vscode "arcanis.vscode-zipfs"
vscode "arrterian.nix-env-selector"
vscode "asvetliakov.vscode-neovim"
vscode "bbenoist.nix"
vscode "bluebrown.yamlfmt"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "jnoortheen.nix-ide"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "orta.vscode-jest"
vscode "rust-lang.rust-analyzer"
vscode "sainnhe.everforest"
vscode "tamasfe.even-better-toml"
vscode "valentjn.vscode-ltex"
vscode "witulski.selection-word-count"
brew "yazi"
brew "fastfetch"
